# AIM: using Survived , Sex , Age and Fare columns of dataframe predict survived using Decision tree

In [1]:
import pandas as pd
import numpy as np 
from sklearn.preprocessing import LabelEncoder
from sklearn import tree

In [23]:
import warnings
warnings.filterwarnings('ignore')

In [5]:
df = pd.read_csv("https://raw.githubusercontent.com/rajanvikash/Decision_Tree_project/main/Titanic_data.csv")
print(df.shape)
df.head(10)

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [6]:
df_new = df[['Age', 'Sex' , 'Fare' , 'Survived']]

df_new.head(10)

    Age     Sex     Fare  Survived
0  22.0    male   7.2500         0
1  38.0  female  71.2833         1
2  26.0  female   7.9250         1
3  35.0  female  53.1000         1
4  35.0    male   8.0500         0
5   NaN    male   8.4583         0
6  54.0    male  51.8625         0
7   2.0    male  21.0750         0
8  27.0  female  11.1333         1
9  14.0  female  30.0708         1

In [10]:
df_new.isnull().sum()

Age         177
Sex           0
Fare          0
Survived      0
dtype: int64

In [11]:
df_new = df_new[~df_new.Age .isnull() ]  #Removing all null columns 
print(df_new.shape)
df_new.isnull().sum()

(714, 4)

Age         0
Sex         0
Fare        0
Survived    0
dtype: int64

In [12]:
le_sex = LabelEncoder()    # creating label encoder for Sex column

In [13]:
df_new['Gender_label'] = le_sex.fit_transform(df_new['Sex'])
df_new

      Age     Sex     Fare  Survived  Gender_label
0    22.0    male   7.2500         0             1
1    38.0  female  71.2833         1             0
2    26.0  female   7.9250         1             0
3    35.0  female  53.1000         1             0
4    35.0    male   8.0500         0             1
..    ...     ...      ...       ...           ...
885  39.0  female  29.1250         0             0
886  27.0    male  13.0000         0             1
887  19.0  female  30.0000         1             0
889  26.0    male  30.0000         1             1
890  32.0    male   7.7500         0             1

[714 rows x 5 columns]

In [14]:
df_final = df_new.drop(['Sex'], axis = 'columns') # droping sex columns after encoding sex 
df_final.head()

    Age     Fare  Survived  Gender_label
0  22.0   7.2500         0             1
1  38.0  71.2833         1             0
2  26.0   7.9250         1             0
3  35.0  53.1000         1             0
4  35.0   8.0500         0             1

In [15]:
x = df_final.drop('Survived' , axis = 'columns')
y = df_final['Survived']

In [16]:
from sklearn.model_selection import train_test_split
x_train , x_test , y_train, y_test = train_test_split(x, y , test_size=0.25)

In [17]:
model = tree.DecisionTreeClassifier()

In [18]:
model.fit(x_train, y_train)

DecisionTreeClassifier()

In [21]:
model.score(x_train ,y_train)

0.9869158878504672

In [19]:
model.score(x_test, y_test)  # finding accuracy of the  on unseen data set data set

0.7039106145251397

In [25]:
model.predict([[35 , 26 , 1]]) # it shows that passenger has not been survived

array([0], dtype=int64)